Tekla Open API Reference for Tekla Structures 2025
CrossSection Constructor (ProfileName)
 Creates a new cross section point instance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CrossSection(
	ProfileName Profile
)
Public Sub New (
	Profile As ProfileName
)
Parameters
Profile
Type: Tekla.Structures.Catalogs.ProfileName
The profile definition.
See Also
Reference
CrossSection Class
CrossSection Overload
Tekla.Structures.Catalogs Namespace